app/views/teams/_team.html.haml

SELECT COUNT(*) FROM "users" INNER JOIN "teammemberships" ON "users".id = "teammemberships".user_id WHERE (("teammemberships".team_id = 1))
---
    = link_to team.name, team_path(team)
  %td= team.users.count