app/views/teams/show.html.haml

SELECT "users".* FROM "users" INNER JOIN "teammemberships" ON "users".id = "teammemberships".user_id WHERE (("teammemberships".team_id = 1))
---

- if @team.users.include?(current_user)

SELECT "teams".* FROM "teams" WHERE "teams"."id" = 1 LIMIT 1
---
  - else
    = link_to "Mitgliedschaft beenden", user_teammembership_path(current_user, current_user.teammemberships.where(:team_id => @team.id).first), :method => "delete", :confirm => "Mitgliedschaft beenden?"

SELECT "participations".* FROM "participations" WHERE ("participations".team_id = 2)
---
    %th Punkte
  - @team.participations.each do |p|