app/views/ladders/index.html.haml

      %td= link_to l.name, ladder_path(l)
      %td= l.participations.count
---
SELECT COUNT(*) FROM "participations" WHERE ("participations".ladder_id = 1)