app/views/ladders/show.html.haml

SELECT "participations".* FROM "participations" WHERE ("participations".ladder_id = 1) ORDER BY elo_score DESC
---
    %th ELO Punkte
  - @ladder.participations.each do |p|

SELECT "games".* FROM "games" WHERE ("games".ladder_id = 1)
---
  %th Team 2
  - @ladder.games.each do |g|