app/controllers/games_controller.rb

  def create
    @ladder = Ladder.find(params[:ladder_id])
    if @ladder
      unless params[:game].blank?
        @game = @ladder.games.build(params[:game])

        unless params[:game][:team1_id].blank? && params[:game][:team2_id].blank?
          team1 = Team.find(@game.team1_id)
          team2 = Team.find(@game.team2:id)
          @game.team1_name = team1.name
          @game.team2_name = team2.name
        end
        if @game.save
---
SELECT "ladders".* FROM "ladders" WHERE "ladders"."id" = 1 LIMIT 1
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 2 LIMIT 1
INSERT INTO "games" ("created_at", "team1_id", "updated_at", "score2", "team2_id", "ladder_id", "score1") VALUES ('2011-06-21 14:24:00.477846', 2, '2011-06-21 14:24:00.477846', NULL, 3, 1, NULL)