app/controllers/ladders_controller.rb

  def index
    @ladders = Ladder.all
---
SELECT "ladders".* FROM "ladders"

  def create
    @ladder = Ladder.new(params[:ladder])
    if @ladder.save
---
INSERT INTO "ladders" ("name", "updated_at", "created_at") VALUES ('elo test', '2011-06-21 16:26:18.394742', '2011-06-21 16:26:18.394742')

  def show
    @ladder = Ladder.find(params[:id])
---
SELECT "ladders".* FROM "ladders" WHERE "ladders"."id" = 1 LIMIT 1