app/controllers/teammemberships_controller.rb

def create
  @user = User.find(params[:user_id])
  @teammembership = @user.teammemberships.build(params[:teammembership])
  if @teammembership.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
INSERT INTO "teammemberships" ("created_at", "user_id", "team_id", "updated_at") VALUES ('2011-06-21 12:28:39.978566', 2, 2, '2011-06-21 12:28:39.978566')