app/controllers/teams_controller.rb

  def create_participation
    @team = Team.find(params[:id])
    @participation = @team.participations.build(params[:participation])
    if @participation.save
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 2 LIMIT 1
INSERT INTO "participations" ("team_id", "ladder_id", "updated_at", "elo_score", "created_at") VALUES (2, NULL, '2011-06-21 13:51:11.033122', NULL, '2011-06-21 13:51:11.033122')

  def create
    @team = Team.new(params[:team])
    if @team.save
---
INSERT INTO "teams" ("name", "updated_at", "created_at") VALUES ('die wilden dreizehn', '2011-06-21 14:20:48.492385', '2011-06-21 14:20:48.492385')

  def destroy
    @team = Team.find(params[:id])
    @team.delete
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 1 LIMIT 1
DELETE FROM "teams" WHERE "teams"."id" = 1