app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "created_at", "name") VALUES ('2011-06-21 11:43:33.019353', '2011-06-21 11:43:33.019353', 'test 1')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.delete